Repository: toghrulmardanov/openedx-translations
Catalog: translations/xblock-drag-and-drop-v2/drag_and_drop_v2/conf/locale/*/LC_MESSAGES/django.po
Languages: az

source: An isosceles triangle with three layers of similar height. It is shown upright, so the widest layer is located at the bottom, and the narrowest layer is located at the top.
az: Benzer yükseklikte üç katmana sahip bir ikizkenar üçgen. Dik olarak gösterilir, böylece en geniş katman altta, en dar katman ise üstte bulunur.

source: The Top Zone
az: Üst Bölge

source: The Middle Zone
az: Orta Bölge

source: The Bottom Zone
az: Alt Bölge

source: Use this zone to associate an item with the top layer of the triangle.
az: Bir öğeyi üçgenin üst katmanıyla ilişkilendirmek için bu bölgeyi kullanın.

source: Use this zone to associate an item with the middle layer of the triangle.
az: Bir öğeyi üçgenin orta katmanıyla ilişkilendirmek için bu bölgeyi kullanın.

source: Use this zone to associate an item with the bottom layer of the triangle.
az: Bir öğeyi üçgenin alt katmanıyla ilişkilendirmek için bu bölgeyi kullanın.

source: Correct! This one belongs to The Top Zone.
az: Doğru! Burası The Top Zone&#39;a ait.

source: Correct! This one belongs to The Middle Zone.
az: Doğru! Bu Orta Bölgeye ait.

source: Correct! This one belongs to The Bottom Zone.
az: Doğru! Bu, Alt Bölge&#39;ye ait.

source: No, this item does not belong here. Try again.
az: Hayır, bu eşya buraya ait değil. Tekrar deneyin.

source: You silly, there are no zones for this one.
az: Seni aptal, bunun için bölge yok.

source: Of course it goes here! It goes anywhere!
az: Tabii ki buraya gelecek! Her yere gider!

source: Goes to the top
az: En üste gider

source: Goes to the middle
az: Ortaya doğru gidiyor

source: Goes to the bottom
az: Dibe doğru gider

source: Goes anywhere
az: Her yere gider

source: I don't belong anywhere
az: Hiçbir yere ait değilim

source: Drag the items onto the image above.
az: Öğeleri yukarıdaki görselin üzerine sürükleyin.

source: Good work! You have completed this drag and drop problem.
az: İyi iş! Bu sürükle bırak problemini tamamladınız.

source: Title
az: Ünvan

source: The title of the drag and drop problem. The title is displayed to learners.
az: Sürükle bırak probleminin başlığı. Başlık öğrencilere gösterilir.

source: Drag and Drop
az: Sürükle ve Bırak

source: Mode
az: Durum

source: Standard mode: the problem provides immediate feedback each time a learner drops an item on a target zone. Assessment mode: the problem provides feedback only after a learner drops all available items on target zones.
az: Standart mod: Öğrencinin hedef bölgeye bir öğeyi düşürdüğü her seferde problem anında geri bildirim sağlar. Değerlendirme modu: problem, yalnızca öğrenci mevcut tüm öğeleri hedef bölgelere bıraktıktan sonra geri bildirim sağlar.

source: Standard
az: Standart

source: Assessment
az: Değerlendirme

source: Maximum attempts
az: Maksimum deneme sayısı

source: Defines the number of times a student can try to answer this problem. If the value is not set, infinite attempts are allowed.
az: Öğrencilerin bu problemi kaç kez cevaplamayı deneme hakkına sahip olduklarını açıklar. Eğer değer belirlenmemişse, sınırsız denemeye izin verilir.

source: Show title
az: Başlığı göster

source: Display the title to the learner?
az: Başlık öğrenciye gösterilsin mi?

source: Problem text
az: Sorun metni

source: The description of the problem or instructions shown to the learner.
az: Öğrenciye gösterilen problemin veya talimatların açıklaması.

source: Show "Problem" heading
az: &quot;Sorun&quot; başlığını göster

source: Display the heading "Problem" above the problem text?
az: Sorun metninin üzerinde &quot;Sorun&quot; başlığı gösterilsin mi?

source: Show answer
az: Yanıtı göster

source: Defines when to show the answer to the problem. A default value can be set in Advanced Settings. To revert setting a custom value, choose the 'Default' option.
az: Sorunun cevabının ne zaman gösterileceğini tanımlar. Gelişmiş Ayarlar&#39;da varsayılan bir değer ayarlanabilir. Özel bir değer ayarlamayı geri almak için &#39;Varsayılan&#39; seçeneğini seçin.

source: Default
az: Öntanımlı

source: Always
az: Her Zaman

source: Answered
az: Yanıtlandı

source: Attempted or Past Due
az: Denendi veya Süresi Geçmiş

source: Closed
az: Kapatıldı

source: Finished
az: Bitirildi

source: Correct or Past Due
az: Doğru veya Süresi Geçmiş

source: Past Due
az: Zaman Aşımına Uğramış

source: Never
az: Asla

source: After All Attempts
az: Tüm Denemelerden Sonra

source: After All Attempts or Correct
az: Tüm Denemelerden ya da Doğru Cevaptan Sonra

source: Attempted
az: Denendi

source: Problem Weight
az: Problem Ağırlığı

source: Defines the number of points the problem is worth.
az: Sorunun değerindeki puan sayısını tanımlar.

source: Item background color
az: Öğe arka plan rengi

source: The background color of draggable items in the problem (example: 'blue' or '#0000ff').
az: Sorundaki sürüklenebilir öğelerin arka plan rengi (örneğin: &#39;mavi&#39; veya &#39;#0000ff&#39;).

source: Item text color
az: Öğe metni rengi

source: Text color to use for draggable items (example: 'white' or '#ffffff').
az: Sürüklenebilir öğeler için kullanılacak metin rengi (örneğin: &#39;beyaz&#39; veya &#39;#ffffff&#39;).

source: Maximum items per zone
az: Bölge başına maksimum öğe

source: This setting limits the number of items that can be dropped into a single zone.
az: Bu ayar, tek bir bölgeye bırakılabilecek öğe sayısını sınırlar.

source: Problem data
az: Sorun verileri

source: Information about zones, items, feedback, explanation and background image for this problem. This information is derived from the input that a course author provides via the interactive editor when configuring the problem.
az: Bu soruna ilişkin bölgeler, öğeler, geri bildirim, açıklama ve arka plan görüntüsü hakkında bilgiler. Bu bilgi, kurs yazarının sorunu yapılandırırken etkileşimli düzenleyici aracılığıyla sağladığı girdiden elde edilir.

source: Information about current positions of items that a learner has dropped on the target image.
az: Bir öğrencinin hedef görüntüye düşürdüğü öğelerin mevcut konumları hakkında bilgi.

source: Number of attempts learner used
az: Öğrencinin kullandığı deneme sayısı

source: Indicates whether a learner has completed the problem at least once
az: Bir öğrencinin problemi en az bir kez tamamlayıp tamamlamadığını gösterir

source: DEPRECATED. Keeps maximum score achieved by student as a weighted value.
az: KULLANIMDAN KALDIRILDI. Öğrencinin aldığı maksimum puanı ağırlıklı değer olarak tutar.

source: Keeps maximum score achieved by student as a raw value between 0 and 1.
az: Öğrencinin aldığı maksimum puanı 0 ile 1 arasında ham değer olarak tutar.

source: Maximum score available of the problem as a raw value between 0 and 1.
az: Sorunun ham değeri olarak 0 ile 1 arasında alınabilecek maksimum puanı.

source: Unknown DnDv2 mode {mode} - course is misconfigured
az: Bilinmeyen DnDv2 modu {mode} - kurs yanlış yapılandırılmış

source: show_answer handler should only be called for assessment mode
az: show_answer işleyicisi yalnızca değerlendirme modu için çağrılmalıdır

source: The answer is unavailable
az: Cevap mevcut değil

source: do_attempt handler should only be called for assessment mode
az: do_attempt işleyicisi yalnızca değerlendirme modu için çağrılmalıdır

source: Max number of attempts reached
az: Maksimum deneme sayısına ulaşıldı

source: Submission deadline has passed.
az: Son teslim tarihi geçti.

source: Loading drag and drop problem.
az: Sürükle bırak sorunu yükleniyor.

source: Basic Settings
az: Temel Ayarlar

source: (inherited from Advanced Settings)
az: (Gelişmiş Ayarlar&#39;dan devralındı)

source: Introductory feedback
az: Giriş geri bildirimi

source: Final feedback
az: Son geri bildirim

source: Explanation Text
az: Açıklama Metni

source: Zones
az: Bölgeler

source: Background Image
az: Arka plan görüntüsü

source: Provide custom image
az: Özel resim sağlayın

source: Generate image automatically
az: Görüntüyü otomatik olarak oluştur

source: Background URL
az: Arka plan URL&#39;si

source: Change background
az: Arka planı değiştir

source: For example, 'http://example.com/background.png' or '/static/background.png'.
az: Örneğin, &#39;http://example.com/background.png&#39; veya &#39;/static/background.png&#39;.

source: Zone Layout
az: Bölge Düzeni

source: Number of columns
az: Sütun sayısı

source: Number of rows
az: Satır sayısı

source: Number of columns and rows.
az: Sütun ve satır sayısı.

source: Zone Size
az: Bölge Boyutu

source: Zone width
az: Bölge genişliği

source: Zone height
az: Bölge yüksekliği

source: Size of a single zone in pixels.
az: Tek bir bölgenin piksel cinsinden boyutu.

source: Generate image and zones
az: Görüntü ve bölgeler oluştur

source: Background description
az: Arka plan açıklaması

source: Please provide a description of the image for non-visual users. The description should provide sufficient information to allow anyone to solve the problem even without seeing the image.
az: Lütfen görsel olmayan kullanıcılar için görselin bir açıklamasını sağlayın. Açıklama herkesin izin vermesi için yeterli bilgi sağlamalıdır görüntüyü görmeden bile sorunu çözmek için.

source: Zone labels
az: Bölge etiketleri

source: Display label names on the image
az: Resimde etiket adlarını görüntüle

source: Zone borders
az: Bölge sınırları

source: Display zone borders on the image
az: Görüntüde bölge sınırlarını görüntüleme

source: Display zone borders when dragging an item
az: Bir öğeyi sürüklerken bölge kenarlıklarını görüntüleme

source: Zone definitions
az: Bölge tanımları

source: Add a zone
az: Bölge ekle

source: Items
az: Ürünler

source: Item definitions
az: Öğe tanımları

source: Add an item
az: Bir öğe ekle

source: Continue
az: Devam et

source: Save
az: Kaydet

source: Cancel
az: İptal

source: Your highest score is {score}
az: En yüksek puanınız {score}

source: Final attempt was used, highest score is {score}
az: Son deneme kullanıldı, en yüksek puan {score}

source: Correctly placed {correct_count} item
az: Doğru yerleştirilmiş {correct_count} öğesi

source: Misplaced {misplaced_count} item
az: Yanlış yerleştirilmiş {misplaced_count} öğesi

source: Misplaced {misplaced_count} item (misplaced item was returned to the item bank)
az: Yanlış yerleştirilmiş {misplaced_count} eşyası (yanlış yerleştirilmiş eşya eşya bankasına iade edildi)

source: Did not place {missing_count} required item
az: {missing_count} gerekli öğeyi yerleştirmedi

source: Submitting
az: Gönderiliyor

source: Unknown Zone
az: Bilinmeyen Bölge

source: Placed in: {zone_title}
az: Yerleştiği yer: {zone_title}

source: Correctly placed in: {zone_title}
az: Doğru yerleştirilmiş: {zone_title}

source: , draggable, grabbed
az: , sürüklenebilir, yakalanmış

source: , draggable
az: , sürüklenebilir

source: No items placed here
az: Buraya hiçbir öğe yerleştirilmedi

source: Items placed here:
az: Buraya yerleştirilen öğeler:

source: , dropzone
az: , boşaltma noktası

source: droppable
az: bırakılabilir

source: Feedback
az: Geri bildirim

source: Explanation
az: Açıklama

source: Close
az: Kapat

source: Keyboard Help
az: Klavye Yardımı

source: This is a screen reader-friendly problem.
az: Bu, ekran okuyucu dostu bir sorundur.

source: Drag and Drop problems consist of draggable items and dropzones. Users should select a draggable item with their keyboard and then navigate to an appropriate dropzone to drop it.
az: Sürükle ve Bırak problemleri sürüklenebilir öğelerden ve bırakma bölgelerinden oluşur. Kullanıcılar klavyeleriyle sürüklenebilir bir öğe seçmeli ve ardından onu bırakmak için uygun bir bırakma bölgesine gitmelidir.

source: You can complete this problem using only your keyboard by following the guidance below:
az: Aşağıdaki yönergeleri izleyerek yalnızca klavyenizi kullanarak bu sorunu çözebilirsiniz:

source: Use only TAB and SHIFT+TAB to navigate between draggable items and drop zones.
az: Sürüklenebilir öğeler ve bırakma bölgeleri arasında gezinmek için yalnızca TAB ve SHIFT+SEKME tuşlarını kullanın.

source: Press CTRL+M to select a draggable item (effectively picking it up).
az: Sürüklenebilir bir öğeyi seçmek (etkili bir şekilde almak) için CTRL+M tuşlarına basın.

source: Navigate using TAB and SHIFT+TAB to the appropriate dropzone and press CTRL+M once more to drop it here.
az: TAB ve SHIFT+TAB tuşlarını kullanarak uygun bırakma bölgesine gidin ve buraya bırakmak için CTRL+M tuşlarına bir kez daha basın.

source: Press ESC if you want to cancel the drop operation (for example, to select a different item).
az: Bırakma işlemini iptal etmek istiyorsanız (örneğin farklı bir öğe seçmek için) ESC tuşuna basın.

source: TAB back to the list of draggable items and repeat this process until all of the draggable items have been placed on their respective dropzones.
az: Sürüklenebilir öğeler listesine TAB ile geri dönün ve tüm sürüklenebilir öğeler ilgili bırakma bölgelerine yerleştirilene kadar bu işlemi tekrarlayın.

source: You have used {used} of {total} attempts.
az: {used} of {total} denemesini kullandınız.

source: Submit
az: Gönder

source: Show Answer
az: Yanıtı Göster

source: Actions
az: Eylemler

source: Go to Beginning
az: Başa Git

source: Reset
az: Sıfırla

source: Some of your answers were not correct.
az: Cevaplarınızdan bazıları doğru değildi.

source: Hints:
az: İpuçları:

source: Correct
az: Doğru

source: Incorrect
az: Yanlış

source: {earned}/{possible} point (graded)
az: {earned} / {possible} puanı (derecelendirilmiş)

source: {earned}/{possible} point (ungraded)
az: {earned} / {possible} puanı (notlandırılmamış)

source: {possible} point possible (graded)
az: {possible} puan mümkün (derecelendirildi)

source: {possible} point possible (ungraded)
az: {possible} puan mümkün (notlandırılmamış)

source: Drag and Drop Problem
az: Sürükle ve Bırak Sorunu

source: Item Bank
az: Öğe Bankası

source: Drop Targets
az: Hedefleri Bırak

source: An error occurred. Unable to load drag and drop problem.
az: Bir hata oluştu. Sürükle ve bırak sorunu yüklenemiyor.

source: You cannot add any more items to this zone.
az: Bu bölgeye daha fazla öğe ekleyemezsiniz.

source: There was an error with your form.
az: Formunuzda bir hata oluştu.

source: Please check over your submission.
az: Lütfen gönderiminizi kontrol edin.

source: Zone {num}
az: Bölge {num}

source: Please check the values you entered.
az: Lütfen girdiğiniz değerleri kontrol ediniz.

source: Saving
az: Kaydediliyor
